Content:
Used Cars Prices

Here you find 78612 records about used cars:
<br>
60 Brand, 382 Model, 33 Modelyear,
<br>
1839 CarModel, 1397 AveragePrice,
<br>
893 MinimumPrice, 916 MaximumPrice,
<br>
over 128 Months/Year.

### Some Questions you should ask yourself about.
1.  Is there any duplicates? .
2. What about the nulls?.
3. Does all columns has the a correct format in its values? if its not how should you make it better?
4. Datatypes?
5. Before starting , after seeing some info about the dataset and from the first look on the dataset , what columns you think will not be necessary in our dataset? (io: what columns you think dropping it will be better?).
<br>
<br>
feel free to wirte only their names in the next cell

Double Click here to start writing

In [3]:
#import Libraries (numpy & Pandas)
import numpy as np 
import pandas as pd

In [4]:
#read Data
Data= pd.read_csv("used_car_prices.csv")
Data

,web-scraper-order,Car Model,Month/Year,Average price,Minimum price,Maximum price
0,1680204632-1,Skoda Octavia A8 2022,2023-03,"967,000 EGP","926,000 EGP","1,017,000 EGP"
1,1680204632-2,Skoda Octavia A8 2022,2023-02,"979,000 EGP","931,000 EGP","1,045,000 EGP"
2,1680204632-3,Skoda Octavia A8 2022,2023-01,"917,000 EGP","893,000 EGP","950,000 EGP"
3,1680204632-4,Skoda Octavia A8 2022,2022-12,"881,000 EGP","793,000 EGP","950,000 EGP"
4,1680204632-5,Skoda Octavia A8 2022,2022-11,"868,000 EGP","789,000 EGP","950,000 EGP"
...,...,...,...,...,...,...
79085,1680204632-79086,Lada 2107 1991,2018-08,"30,000 EGP","26,000 EGP","33,000 EGP"
79086,1680204632-79087,Lada 2107 1991,2018-07,"33,000 EGP","32,000 EGP","35,000 EGP"
79087,1680204632-79088,Lada 2107 1991,2018-01,"28,000 EGP","25,000 EGP","30,000 EGP"
79088,1680204632-79089,Lada 2107 1991,2017-12,"27,000 EGP","25,000 EGP","28,000 EGP"
79089,1680204632-79090,Lada 2107 1991,2016-03,"24,000 EGP","23,000 EGP","26,000 EGP"

In [5]:
#print the first 8 row
Data.head(8)

,web-scraper-order,Car Model,Month/Year,Average price,Minimum price,Maximum price
0,1680204632-1,Skoda Octavia A8 2022,2023-03,"967,000 EGP","926,000 EGP","1,017,000 EGP"
1,1680204632-2,Skoda Octavia A8 2022,2023-02,"979,000 EGP","931,000 EGP","1,045,000 EGP"
2,1680204632-3,Skoda Octavia A8 2022,2023-01,"917,000 EGP","893,000 EGP","950,000 EGP"
3,1680204632-4,Skoda Octavia A8 2022,2022-12,"881,000 EGP","793,000 EGP","950,000 EGP"
4,1680204632-5,Skoda Octavia A8 2022,2022-11,"868,000 EGP","789,000 EGP","950,000 EGP"
5,1680204632-6,Skoda Octavia A8 2022,2022-10,"797,000 EGP","789,000 EGP","808,000 EGP"
6,1680204632-7,Skoda Octavia A8 2022,2022-09,"837,000 EGP","770,000 EGP","874,000 EGP"
7,1680204632-8,Skoda Octavia A8 2022,2022-08,"779,000 EGP","722,000 EGP","855,000 EGP"

In [6]:
#print the shape Like (There are 84548 rows and 22 columns)
Data.shape

(79090, 6)

In [7]:
# try seeing some information about the data
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79090 entries, 0 to 79089
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   web-scraper-order  79090 non-null  object
 1   Car Model          79090 non-null  object
 2   Month/Year         78612 non-null  object
 3   Average price      78612 non-null  object
 4   Minimum price      78612 non-null  object
 5   Maximum price      78612 non-null  object
dtypes: object(6)
memory usage: 3.6+ MB

In [8]:
# show the number of duplicates here
Data.duplicated

<bound method DataFrame.duplicated of       web-scraper-order              Car Model Month/Year Average price  \
0          1680204632-1  Skoda Octavia A8 2022    2023-03   967,000 EGP
1          1680204632-2  Skoda Octavia A8 2022    2023-02   979,000 EGP
2          1680204632-3  Skoda Octavia A8 2022    2023-01   917,000 EGP
3          1680204632-4  Skoda Octavia A8 2022    2022-12   881,000 EGP
4          1680204632-5  Skoda Octavia A8 2022    2022-11   868,000 EGP
...                 ...                    ...        ...           ...
79085  1680204632-79086         Lada 2107 1991    2018-08    30,000 EGP
79086  1680204632-79087         Lada 2107 1991    2018-07    33,000 EGP
79087  1680204632-79088         Lada 2107 1991    2018-01    28,000 EGP
79088  1680204632-79089         Lada 2107 1991    2017-12    27,000 EGP
79089  1680204632-79090         Lada 2107 1991    2016-03    24,000 EGP

      Minimum price  Maximum price
0       926,000 EGP  1,017,000 EGP
1       931,000 EGP  1,045,000 EGP
2       893,000 EGP    950,000 EGP
3       793,000 EGP    950,000 EGP
4       789,000 EGP    950,000 EGP
...             ...            ...
79085    26,000 EGP     33,000 EGP
79086    32,000 EGP     35,000 EGP
79087    25,000 EGP     30,000 EGP
79088    25,000 EGP     28,000 EGP
79089    23,000 EGP     26,000 EGP

[79090 rows x 6 columns]>

In [9]:
Data.duplicated().sum()

0

In [10]:
# show number of nulls
Data.isnull().sum()

web-scraper-order      0
Car Model              0
Month/Year           478
Average price        478
Minimum price        478
Maximum price        478
dtype: int64

In [11]:
# updated the column names Like(To Start with Upper Litter)
data=Data.columns 
data

Index(['web-scraper-order', 'Car Model', 'Month/Year', 'Average price',
       'Minimum price', 'Maximum price'],
      dtype='object')

In [12]:
data.str.capitalize()

Index(['Web-scraper-order', 'Car model', 'Month/year', 'Average price',
       'Minimum price', 'Maximum price'],
      dtype='object')

In [77]:
# Split Car Full Data into Brand, Model, And Year of The Model
Data['Brand'] = Data['Car Model'].str.split().str[0:2]
Data['Model'] = Data['Car Model'].str.split().str[2]
Data['Year'] = Data['Car Model'].str.split().str[3]
Data[["Brand",'Model','Year']]

                  Brand Model  Year
0      [Skoda, Octavia]    A8  2022
1      [Skoda, Octavia]    A8  2022
2      [Skoda, Octavia]    A8  2022
3      [Skoda, Octavia]    A8  2022
4      [Skoda, Octavia]    A8  2022
...                 ...   ...   ...
79085      [Lada, 2107]  1991   NaN
79086      [Lada, 2107]  1991   NaN
79087      [Lada, 2107]  1991   NaN
79088      [Lada, 2107]  1991   NaN
79089      [Lada, 2107]  1991   NaN

[79090 rows x 3 columns]

In [78]:
#Split Month/Year Column to Year and Month
Data["Month"]=Data["Month/Year"].str.split("-").str[1]
Data["Year"]=Data["Month/Year"].str.split("-").str[0]
Data[["Year","Month"]]

       Year Month
0      2023    03
1      2023    02
2      2023    01
3      2022    12
4      2022    11
...     ...   ...
79085  2018    08
79086  2018    07
79087  2018    01
79088  2017    12
79089  2016    03

[79090 rows x 2 columns]

In [152]:
Data['Average price'] = Data['Average price'].replace('EGP', '')
Data['Average price'] = Data['Average price'].astype(float)
Data['Average price'].dtype

dtype('float64')

In [154]:
Data['Minimum price '] = Data['Minimum price'].replace('EGP', '')
Data['Minimum price '] = Data['Minimum price'].astype(float)
Data['Minimum price '].dtype

dtype('float64')

In [159]:
Data['Minimum price ']

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
         ..
79085   NaN
79086   NaN
79087   NaN
79088   NaN
79089   NaN
Name: Minimum price , Length: 79090, dtype: float64

#let's start with (Average price ,Minimum price ,Maximum price ) , see the number of nulls in them , #replace these nulls with the ( mean , median and mode) of these columns
#and in the end check that there are not nulls in data

In [156]:
#Average price 
Data["Average price"].isnull().sum()

79090

In [157]:
###
columns_to_handle = ['Average price', 'Minimum price', 'Maximum price']
for column in columns_to_handle:
    mean_value = Data[column].mean()
    Data[column].fillna(mean_value, inplace=True)

In [158]:
Data[columns_to_handle].isnull().sum()

Average price    79090
Minimum price    79090
Maximum price    79090
dtype: int64

In [148]:
Data[column].fillna(mean_value, inplace=True)

In [133]:
 Data.isnull().sum()

web-scraper-order        0
Car Model                0
Month/Year             478
Average price        79090
Minimum price        79090
Maximum price        79090
Brand                    0
Model                    0
Year                   478
Month                  478
dtype: int64